In [31]:
import pandas as pd
import json
import sqlite3

with open("DataRestaurant.json") as f:
    data = json.load(f)

dataframe = pd.DataFrame(data)
dataframe.head()

,Cities,ChickFilA,McDonalds,Total_Restaraunts,PercentChickFilA,PercentMcDonalds
0,Seattle,3,23,260,1.153846,8.846154
1,Portland,2,15,452,0.442478,3.318584
2,San Francisco,6,35,324,1.851852,10.802469
3,Los Angeles,8,65,523,1.529637,12.428298

In [35]:
import requests

countries_api_res = requests.get('http://api.worldbank.org/countries?format=json&per_page=100')
countries_data = countries_api_res.json()[1]
dataframe2 = pd.DataFrame(countries_data)

In [50]:
dataframe2.head(15)

,id,iso2Code,name,region,adminregion,incomeLevel,lendingType,capitalCity,longitude,latitude
0,ABW,AW,Aruba,"{'id': 'LCN', 'iso2code': 'ZJ', 'value': 'Lati...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'HIC', 'iso2code': 'XD', 'value': 'High...","{'id': 'LNX', 'iso2code': 'XX', 'value': 'Not ...",Oranjestad,-70.0167,12.5167
1,AFE,ZH,Africa Eastern and Southern,"{'id': 'NA', 'iso2code': 'NA', 'value': 'Aggre...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'NA', 'iso2code': 'NA', 'value': 'Aggre...","{'id': '', 'iso2code': '', 'value': 'Aggregates'}",,,
2,AFG,AF,Afghanistan,"{'id': 'SAS', 'iso2code': '8S', 'value': 'Sout...","{'id': 'SAS', 'iso2code': '8S', 'value': 'Sout...","{'id': 'LIC', 'iso2code': 'XM', 'value': 'Low ...","{'id': 'IDX', 'iso2code': 'XI', 'value': 'IDA'}",Kabul,69.1761,34.5228
3,AFR,A9,Africa,"{'id': 'NA', 'iso2code': 'NA', 'value': 'Aggre...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'NA', 'iso2code': 'NA', 'value': 'Aggre...","{'id': '', 'iso2code': '', 'value': 'Aggregates'}",,,
4,AFW,ZI,Africa Western and Central,"{'id': 'NA', 'iso2code': 'NA', 'value': 'Aggre...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'NA', 'iso2code': 'NA', 'value': 'Aggre...","{'id': '', 'iso2code': '', 'value': 'Aggregates'}",,,
5,AGO,AO,Angola,"{'id': 'SSF', 'iso2code': 'ZG', 'value': 'Sub-...","{'id': 'SSA', 'iso2code': 'ZF', 'value': 'Sub-...","{'id': 'LMC', 'iso2code': 'XN', 'value': 'Lowe...","{'id': 'IBD', 'iso2code': 'XF', 'value': 'IBRD'}",Luanda,13.242,-8.81155
6,ALB,AL,Albania,"{'id': 'ECS', 'iso2code': 'Z7', 'value': 'Euro...","{'id': 'ECA', 'iso2code': '7E', 'value': 'Euro...","{'id': 'UMC', 'iso2code': 'XT', 'value': 'Uppe...","{'id': 'IBD', 'iso2code': 'XF', 'value': 'IBRD'}",Tirane,19.8172,41.3317
7,AND,AD,Andorra,"{'id': 'ECS', 'iso2code': 'Z7', 'value': 'Euro...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'HIC', 'iso2code': 'XD', 'value': 'High...","{'id': 'LNX', 'iso2code': 'XX', 'value': 'Not ...",Andorra la Vella,1.5218,42.5075
8,ARB,1A,Arab World,"{'id': 'NA', 'iso2code': 'NA', 'value': 'Aggre...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'NA', 'iso2code': 'NA', 'value': 'Aggre...","{'id': '', 'iso2code': '', 'value': 'Aggregates'}",,,
9,ARE,AE,United Arab Emirates,"{'id': 'MEA', 'iso2code': 'ZQ', 'value': 'Midd...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'HIC', 'iso2code': 'XD', 'value': 'High...","{'id': 'LNX', 'iso2code': 'XX', 'value': 'Not ...",Abu Dhabi,54.3705,24.4764
10,ARG,AR,Argentina,"{'id': 'LCN', 'iso2code': 'ZJ', 'value': 'Lati...","{'id': 'LAC', 'iso2code': 'XJ', 'value': 'Lati...","{'id': 'UMC', 'iso2code': 'XT', 'value': 'Uppe...","{'id': 'IBD', 'iso2code': 'XF', 'value': 'IBRD'}",Buenos Aires,-58.4173,-34.6118
11,ARM,AM,Armenia,"{'id': 'ECS', 'iso2code': 'Z7', 'value': 'Euro...","{'id': 'ECA', 'iso2code': '7E', 'value': 'Euro...","{'id': 'UMC', 'iso2code': 'XT', 'value': 'Uppe...","{'id': 'IBD', 'iso2code': 'XF', 'value': 'IBRD'}",Yerevan,44.509,40.1596
12,ASM,AS,American Samoa,"{'id': 'EAS', 'iso2code': 'Z4', 'value': 'East...","{'id': 'EAP', 'iso2code': '4E', 'value': 'East...","{'id': 'UMC', 'iso2code': 'XT', 'value': 'Uppe...","{'id': 'LNX', 'iso2code': 'XX', 'value': 'Not ...",Pago Pago,-170.691,-14.2846
13,ATG,AG,Antigua and Barbuda,"{'id': 'LCN', 'iso2code': 'ZJ', 'value': 'Lati...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'HIC', 'iso2code': 'XD', 'value': 'High...","{'id': 'IBD', 'iso2code': 'XF', 'value': 'IBRD'}",Saint John's,-61.8456,17.1175
14,AUS,AU,Australia,"{'id': 'EAS', 'iso2code': 'Z4', 'value': 'East...","{'id': '', 'iso2code': '', 'value': ''}","{'id': 'HIC', 'iso2code': 'XD', 'value': 'High...","{'id': 'LNX', 'iso2code': 'XX', 'value': 'Not ...",Canberra,149.129,-35.282

In [64]:
dataframe2.columns

Index(['id', 'iso2Code', 'name', 'region', 'adminregion', 'incomeLevel',
       'lendingType', 'capitalCity', 'longitude', 'latitude'],
      dtype='object')

In [78]:
dataframe2.to_csv("WorldCountries.csv")

In [79]:
dataframe.columns

Index(['Cities', 'ChickFilA', 'McDonalds', 'Total_Restaraunts',
       'PercentChickFilA', 'PercentMcDonalds'],
      dtype='object')

In [80]:
column = ["Batman","Superman","IronMan"]
titled_column = {"name": column,
                "height": [6.3,6.5,5.9],
                "weight": [210,500,180]}

In [81]:
##print the data
data = pd.DataFrame(titled_column)
print(data)

       name  height  weight
0    Batman     6.3     210
1  Superman     6.5     500
2   IronMan     5.9     180

In [82]:
##choose a specific column of data to show
data = pd.DataFrame(titled_column)
selected_column = data["weight"]
print(selected_column)

0    210
1    500
2    180
Name: weight, dtype: int64

In [83]:
##only show or print a certain row from a column
data = pd.DataFrame(titled_column)
selected_column = data["weight"]
selected_row = data.iloc[1]["weight"]
print(selected_row)

500

In [84]:
##manipulate the data
bmi = []
#weight/(height**2)
for i in range(len(data)):
    bmi_score = data["weight"][i]/(data["height"][i]**2)
    bmi.append(bmi_score)

data["bmi"] = bmi

print(data)

       name  height  weight        bmi
0    Batman     6.3     210   5.291005
1  Superman     6.5     500  11.834320
2   IronMan     5.9     180   5.170928

In [85]:
##How to save data into a file
print(data)
data.to_json("DataTest.json")

       name  height  weight        bmi
0    Batman     6.3     210   5.291005
1  Superman     6.5     500  11.834320
2   IronMan     5.9     180   5.170928

In [86]:
##Importing data from a Json file // For csv file just change read_json to read_csv
import pandas as pd

NewData = pd.read_json("DataTest.json")
NewData.head()

       name  height  weight        bmi
0    Batman     6.3     210   5.291005
1  Superman     6.5     500  11.834320
2   IronMan     5.9     180   5.170928

In [87]:
##import a sqlite3 database
import sqlite3
connection = sqlite3.connect("gta.db")
GTAdata = pd.read_sql("SELECT * FROM gta", connection)
first_5_rows = GTAdata.head()
last_2_rows = GTAdata.tail(2)

#Select only specific rows from the DB into a variable
filtered_row = GTAdata[GTAdata["city"] == "Liberty City"]
print(filtered_row)

   release_year          release_name          city
2          2001  Grand Theft Auto III  Liberty City
5          2008   Grand Theft Auto IV  Liberty City

In [88]:
##Replace data in the DB with new data
replaced_city = GTAdata.replace("Liberty City", "New York")
print(replaced_city)

   release_year                   release_name                   city
0          1997               Grand Theft Auto  state of New Guernsey
1          1999             Grand Theft Auto 2          Anywhere, USA
2          2001           Grand Theft Auto III               New York
3          2002    Grand Theft Auto: Vice City              Vice City
4          2004  Grand Theft Auto: San Andreas   state of San Andreas
5          2008            Grand Theft Auto IV               New York
6          2013             Grand Theft Auto V             Los Santos

In [89]:
#remove columns 
# axis=1 is collumns and axis=0 is rows

## How to remove multiple columns 
# remove_data = GTAdata.drop(["city","release_year"], axis=1)

remove_data = GTAdata.drop("city", axis=1)
print(remove_data)

   release_year                   release_name
0          1997               Grand Theft Auto
1          1999             Grand Theft Auto 2
2          2001           Grand Theft Auto III
3          2002    Grand Theft Auto: Vice City
4          2004  Grand Theft Auto: San Andreas
5          2008            Grand Theft Auto IV
6          2013             Grand Theft Auto V

In [90]:
##Remove rows

remove_rows = GTAdata.iloc[1:6]
print(remove_rows)

   release_year                   release_name                  city
1          1999             Grand Theft Auto 2         Anywhere, USA
2          2001           Grand Theft Auto III          Liberty City
3          2002    Grand Theft Auto: Vice City             Vice City
4          2004  Grand Theft Auto: San Andreas  state of San Andreas
5          2008            Grand Theft Auto IV          Liberty City

In [91]:
##Add new rows to the dataframe

row = {"release_year": "2021",
       "release_name": "Natural Vision Evolved",
       "city": "Los Angeles"}

new_role_data = GTAdata.append(row, ignore_index=True)
print(new_role_data)

  release_year                   release_name                   city
0         1997               Grand Theft Auto  state of New Guernsey
1         1999             Grand Theft Auto 2          Anywhere, USA
2         2001           Grand Theft Auto III           Liberty City
3         2002    Grand Theft Auto: Vice City              Vice City
4         2004  Grand Theft Auto: San Andreas   state of San Andreas
5         2008            Grand Theft Auto IV           Liberty City
6         2013             Grand Theft Auto V             Los Santos
7         2021         Natural Vision Evolved            Los Angeles

C:\Users\dylan\AppData\Local\Temp\ipykernel_38260\2675679750.py:7: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_role_data = GTAdata.append(row, ignore_index=True)